* Prettify symbols

https://www.gnu.org/software/auctex/manual/auctex/Prettifying.html

... not sure this is how it works. Plus I think it was already on.

#+BEGIN_SRC emacs-lisp :tangle no
(add-hook 'TeX-mode-hook
    (lambda ()
      (add-to-list 'prettify-symbols-mode)))
#+END_SRC

Trying the next bit from https://yoo2080.wordpress.com/2016/11/15/how-to-make-prettify-symbols-mode-work-with-auctex/

DGM 27 august 2020: turned off cos I don't like prettifying symbols any more.
#+BEGIN_SRC emacs-lisp :tangle no
(add-hook 'TeX-mode-hook 'prettify-symbols-mode)
#+END_SRC

#+RESULTS:
| prettify-symbols-mode | (lambda nil (add-to-list 'prettify-symbols-mode)) | (lambda nil (setq TeX-command-default latexmk)) | (lambda nil (add-to-list 'TeX-output-view-style '(^pdf$ . /usr/bin/evince  %n %o %b))) | pandoc-mode |

** Package =latex-pretty-symbols=
DGM 27 august 2020: turned off cos I don't like prettifying symbols any more.

#+source: latex-pretty-symbols 
#+begin_src emacs-lisp :tangle no
(use-package latex-pretty-symbols
  :defer t)
(add-hook 'LaTeX-mode-hook 'latex-unicode-simplified) 
#+END_SRC

#+RESULTS: latex-pretty-symbols
| er/add-latex-mode-expansions | TeX-PDF-mode | turn-on-reftex | latex-unicode-simplified |

#+end_src

*** Default Bibliography
This is important when editing source code in Org-babel, since the LaTeX source code block being edited probably doesn't include the \bibliography{} command that RefTeX uses to find bibliographic database(s).  Make certain also that RefTeX has a path to the bibliographic databases.  This source-code block is turned off be default as it should be configured by the user in a personal file/directory.

#+srcname: default-bibliography
#+begin_src emacs-lisp :tangle no

 (setq reftex-default-bibliography '("/media/dgm/blue/documents/bibs/socbib.bib"))

#+end_src

#+RESULTS: default-bibliography
| /media/dgm/blue/documents/bibs/socbib.bib |

*** Use pdfLaTeX
    - Take this out to compile to DVI, instead.
#+srcname: pdf-mode
#+begin_src emacs-lisp :tangle no
      (add-hook 'LaTeX-mode-hook 'TeX-PDF-mode)
#+end_src

#+RESULTS: pdf-mode
| er/add-latex-mode-expansions | TeX-PDF-mode | turn-on-reftex | latex-unicode-simplified |


